var TIME_RANGE = [
    { "from": 0, "to": 6 },
    { "from": 6, "to": 12 },
    { "from": 12, "to": 14 },
    { "from": 13, "to": 18 },
    { "from": 18, "to": 0 },
];

var TIME_RANGE_MSG = ["새벽", "아침", "점심", "오후", "저녁"];

var MSG_PROGRESS = ["제출", "데이터 모집 중", "검증 중", "답변 대기 중", "정보통신팀 답변 도착"];

var BLDG = {
    "N1": {
        "lat": 36.374,
        "lng": 127.3655
    },
    "교양분관": {
        "lat": 36.374,
        "lng": 127.360
    },
    "태울관": {
        "lat": 36.373,
        "lng": 127.359
    },
    "학생회관": {
        "lat": 36.3731,
        "lng": 127.3605
    },
    "창의관": {
        "lat": 36.370,
        "lng": 127.362
    },
    "과학도서관": {
        "lat": 36.369,
        "lng": 127.362
    },
    "세종관": {
        "lat": 36.371,
        "lng": 127.366
    },
    "나눔관": {
        "lat": 36.371,
        "lng": 127.355
    },
    "미르관": {
        "lat": 36.370,
        "lng": 127.355
    },
    "나래관": {
        "lat": 36.370,
        "lng": 127.355
    },
    "다솜관": {
        "lat": 36.368,
        "lng": 127.356
    },
    "희망관": {
        "lat": 36.368,
        "lng": 127.356
    },
    "아름관": {
        "lat": 36.373,
        "lng": 127.356
    },
    "소망관": {
        "lat": 36.373,
        "lng": 127.357
    },
    "사랑관": {
        "lat": 36.373,
        "lng": 127.358
    },
    "성실관": {
        "lat": 36.374,
        "lng": 127.358
    },
    "진리관": {
        "lat": 36.374,
        "lng": 127.359
    },
    "신뢰관": {
        "lat": 36.375,
        "lng": 127.358
    },
    "지혜관": {
        "lat": 36.375,
        "lng": 127.358
    }
};