var TIME_RANGE = [
    { "from": 0, "to": 6 },
    { "from": 6, "to": 12 },
    { "from": 12, "to": 14 },
    { "from": 13, "to": 18 },
    { "from": 18, "to": 0 },
];

var TIME_RANGE_MSG = ["새벽", "아침", "점심", "오후", "저녁"];

var WIFI_STRENGTH_MSG = ["전혀 차 있지않다", "거의 채워져 있지 않다", "절반", "대부분 차 있다", "모두 차 있다"];
var WIFI_TYPE_MSG = ["Welcome_KAIST", "그외 와이파이", "랜선"];

var MSG_PROGRESS = ["제출", "데이터 모집 중", "검증 중", "답변 대기 중", "정보통신팀 답변 도착"];

var BLDG = [{
        "name": "N1",
        "lat": 36.374,
        "lng": 127.3655
    },
    {
        "name": "교양분관",
        "lat": 36.374,
        "lng": 127.360
    },
    {
        "name": "태울관",
        "lat": 36.373,
        "lng": 127.3598
    },
    {
        "name": "학생회관",
        "lat": 36.3731,
        "lng": 127.3605
    },
    {
        "name": "창의관",
        "lat": 36.370,
        "lng": 127.362
    },
    {
        "name": "과학도서관",
        "lat": 36.369,
        "lng": 127.362
    },
    {
        "name": "세종관",
        "lat": 36.371,
        "lng": 127.366
    },
    {
        "name": "나눔관",
        "lat": 36.371,
        "lng": 127.355731
    },
    {
        "name": "미르관",
        "lat": 36.370338,
        "lng": 127.355732
    },
    {
        "name": "나래관",
        "lat": 36.370338,
        "lng": 127.355731
    },
    {
        "name": "다솜관",
        "lat": 36.368243,
        "lng": 127.356951
    },
    {
        "name": "희망관",
        "lat": 36.368,
        "lng": 127.356951
    },
    {
        "name": "아름관",
        "lat": 36.373732,
        "lng": 127.356711
    },
    {
        "name": "소망관",
        "lat": 36.373732,
        "lng": 127.356711
    },
    {
        "name": "사랑관",
        "lat": 36.373732,
        "lng": 127.358535
    },
    {
        "name": "성실관",
        "lat": 36.374280,
        "lng": 127.358916
    },
    {
        "name": "진리관",
        "lat": 36.374677,
        "lng": 127.359200
    },
    {
        "name": "신뢰관",
        "lat": 36.375195,
        "lng": 127.358932
    },
    {
        "name": "지혜관",
        "lat": 36.375843,
        "lng": 127.358583
    },

    { //20
        "name": "기계동",
        "lat": 36.372472,
        "lng": 127.358673
    },
    {
        "name": "인사동",
        "lat": 36.373193,
        "lng": 127.362673
    }
];