var TIME_RANGE = [
    { "from": 0, "to": 6 },
    { "from": 6, "to": 12 },
    { "from": 12, "to": 14 },
    { "from": 13, "to": 18 },
    { "from": 18, "to": 0 },
];

var TIME_RANGE_MSG = ["새벽", "아침", "점심", "오후", "저녁"];

var WIFI_STRENGTH_MSG = ["전혀 차 있지않다", "1개", "2개", "3개", "모두 차 있다"];
var WIFI_TYPE_MSG = ["Welcome_KAIST", "그외 와이파이", "랜선"];

var MSG_PROGRESS = ["제출", "데이터 모집 중", "검증 중", "답변 대기 중", "정보통신팀 답변 도착"];

var BLDG = {
    "N1": {
        "uid": "LnrULZ9",
        "lat": 36.374,
        "lng": 127.3655
    },
    "교양분관": {
        "uid": "FxWF6sv",
        "lat": 36.374,
        "lng": 127.360
    },
    "태울관": {
        "uid": "ynKpciK",
        "lat": 36.373,
        "lng": 127.3598
    },
    "학생회관": {
        "uid": "n93vnQq",
        "lat": 36.3731,
        "lng": 127.3605
    },
    "창의관": {
        "uid": "SgdCPOF",
        "lat": 36.370,
        "lng": 127.362
    },
    "과학도서관": {
        "uid": "j5hMuNp",
        "lat": 36.369,
        "lng": 127.362
    },
    "세종관": {
        "uid": "wGcNI2L",
        "lat": 36.371,
        "lng": 127.366
    },
    "나눔관": {
        "uid": "96K2iLj",
        "lat": 36.371,
        "lng": 127.355
    },
    "미르관": {
        "uid": "LLJqfXf",
        "lat": 36.370338,
        "lng": 127.355731
    },
    "나래관": {
        "uid": "JBrmH38",
        "lat": 36.370338,
        "lng": 127.355731
    },
    "다솜관": {
        "uid": "173ALSx",
        "lat": 36.368243,
        "lng": 127.356951
    },
    "희망관": {
        "uid": "9BaU2z5",
        "lat": 36.368,
        "lng": 127.356
    },
    "아름관": {
        "uid": "Q0b0V2W",
        "lat": 36.373732,
        "lng": 127.356711
    },
    "소망관": {
        "uid": "U0Gy89d",
        "lat": 36.373732,
        "lng": 127.356711
    },
    "사랑관": {
        "uid": "8UFZJIc",
        "lat": 36.373732,
        "lng": 127.358535
    },
    "성실관": {
        "uid": "4dRb1DJ",
        "lat": 36.374280,
        "lng": 127.358916
    },
    "진리관": {
        "uid": "DWXomSa",
        "lat": 36.374677,
        "lng": 127.359200
    },
    "신뢰관": {
        "uid": "vWxWBnt",
        "lat": 36.375195,
        "lng": 127.358932
    },
    "지혜관": {
        "uid": "34fkb1e",
        "lat": 36.375843,
        "lng": 127.358583
    },
    "기계동": {
        "uid": "qnve7ac",
        "lat": 36.372472,
        "lng": 127.358673
    }
};